# DisallowedPathCurve Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..WallFailures..::..DisallowedPathCurve Property
BuiltInFailures..::..WallFailures Class See Also
---
Cannot create stacked elliptical wall with offsets.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DisallowedPathCurve { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DisallowedPathCurve As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DisallowedPathCurve {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..WallFailures Class
Autodesk.Revit.DB Namespace